# Задача 9
# Указав номер четверти прямоугольной системы координат, 
# показать допустимые значения координат для точек этой четверти

a = int(input('Введите номер четверти системы координат (от 1 до 4): '))
if a == 1:
    print(f'Номер четверти: {a}, Допустимые значения: x > 0, y > 0')
elif a == 2:
    print(f'Номер четверти: {a}, Допустимые значения: x > 0, y > 0')
elif a == 3:
    print(f'Номер четверти: {a}, Допустимые значения: x > 0, y > 0')
elif a == 4:
    print(f'Номер четверти: {a}, Допустимые значения: x > 0, y > 0')
else:
    print(f'Введенное значение "{a}" не является номером четверти системы координат')