# Напишите программу, которая найдёт произведение пар чисел списка.
# Парой считаем первый и последний элемент, второй и предпоследний и т.д.

# Пример:

# - [2, 3, 4, 5, 6] => [12, 15, 16];
# - [2, 3, 5, 6] => [12, 15]

# Вариант решения 1
my_list = [2, 3, 4, 5, 6]
i = 0
while i < len(my_list)/2:
    result = my_list[i]*my_list[-(i+1)]
    i += 1
    print(result)

# Варант решения 2
# my_list = [2, 3, 4, 5, 6]
# for i in range(int(len(my_list)/2)+1):
#     result = my_list[i]*my_list[-(i+1)]
#     print(result)
