# Напишите программу, которая определит позицию второго 
# вхождения строки в списке либо сообщит, что её нет.

# - список: ["qwe", "asd", "zxc", "qwe", "ertqwe"], ищем: "qwe", ответ: 3
# - список: ["йцу", "фыв", "ячс", "цук", "йцукен", "йцу"], ищем: "йцу", ответ: 5
# - список: ["йцу", "фыв", "ячс", "цук", "йцукен"], ищем: "йцу", ответ: -1
# - список: ["123", "234", 123, "567"], ищем: "123", ответ: -1
# - список: [], ищем: "123", ответ: -1

my_list = ["qwe", "asd", "zxc", "qwe", "ertqwe"]
count = 0
my_list = ["йцу", "фыв", "ячс", "цук", "йцукен", "йцу", "йцу", "йцу"]
for i in range(len(my_list)):
    if my_list[i] == 'йцу':
        count += 1
        if count > 1:
            print(i)
            break
        else:
            print('Нет второго вхождения')